nxp-mcuxpresso/mcux-sdk/devices/MIMXRT1187/mcuxpresso/startup_mimxrt1187_cm7.cpp
WEAK void DMA3_CH26_IRQHandler(void)
{   DMA3_CH26_DriverIRQHandler();
}

WEAK void DMA3_CH27_IRQHandler(void)
{   DMA3_CH27_DriverIRQHandler();
}

WEAK void DMA3_CH28_IRQHandler(void)
{   DMA3_CH28_DriverIRQHandler();
}

WEAK void DMA3_CH29_IRQHandler(void)
{   DMA3_CH29_DriverIRQHandler();
}

WEAK void DMA3_CH30_IRQHandler(void)
{   DMA3_CH30_DriverIRQHandler();
}

WEAK void DMA3_CH31_IRQHandler(void)
{   DMA3_CH31_DriverIRQHandler();
}

WEAK void DMA4_ERROR_IRQHandler(void)
{   DMA4_ERROR_DriverIRQHandler();
}

WEAK void DMA4_CH0_CH1_CH32_CH33_IRQHandler(void)
{   DMA4_CH0_CH1_CH32_CH33_DriverIRQHandler();
}

WEAK void DMA4_CH2_CH3_CH34_CH35_IRQHandler(void)
{   DMA4_CH2_CH3_CH34_CH35_DriverIRQHandler();
}

WEAK void DMA4_CH4_CH5_CH36_CH37_IRQHandler(void)
{   DMA4_CH4_CH5_CH36_CH37_DriverIRQHandler();
}

WEAK void DMA4_CH6_CH7_CH38_CH39_IRQHandler(void)
{   DMA4_CH6_CH7_CH38_CH39_DriverIRQHandler();
}

WEAK void DMA4_CH8_CH9_CH40_CH41_IRQHandler(void)
{   DMA4_CH8_CH9_CH40_CH41_DriverIRQHandler();
}

WEAK void DMA4_CH10_CH11_CH42_CH43_IRQHandler(void)
{   DMA4_CH10_CH11_CH42_CH43_DriverIRQHandler();
}

WEAK void DMA4_CH12_CH13_CH44_CH45_IRQHandler(void)
{   DMA4_CH12_CH13_CH44_CH45_DriverIRQHandler();
}

WEAK void DMA4_CH14_CH15_CH46_CH47_IRQHandler(void)
{   DMA4_CH14_CH15_CH46_CH47_DriverIRQHandler();
}

WEAK void DMA4_CH16_CH17_CH48_CH49_IRQHandler(void)
{   DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler();
}

WEAK void DMA4_CH18_CH19_CH50_CH51_IRQHandler(void)
{   DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler();
}

WEAK void DMA4_CH20_CH21_CH52_CH53_IRQHandler(void)
{   DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler();
}

WEAK void DMA4_CH22_CH23_CH54_CH55_IRQHandler(void)
{   DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler();
}

WEAK void DMA4_CH24_CH25_CH56_CH57_IRQHandler(void)
{   DMA4_CH24_CH25_CH56_CH57_DriverIRQHandler();
}

WEAK void DMA4_CH26_CH27_CH58_CH59_IRQHandler(void)
{   DMA4_CH26_CH27_CH58_CH59_DriverIRQHandler();
}

WEAK void DMA4_CH28_CH29_CH60_CH61_IRQHandler(void)
{   DMA4_CH28_CH29_CH60_CH61_DriverIRQHandler();
}

WEAK void DMA4_CH30_CH31_CH62_CH63_IRQHandler(void)
{   DMA4_CH30_CH31_CH62_CH63_DriverIRQHandler();
}

WEAK void XBAR1_CH0_CH1_IRQHandler(void)
{   XBAR1_CH0_CH1_DriverIRQHandler();
}

WEAK void XBAR1_CH2_CH3_IRQHandler(void)
{   XBAR1_CH2_CH3_DriverIRQHandler();
}

WEAK void SINC3_CH0_CH1_CH2_CH3_IRQHandler(void)
{   SINC3_CH0_CH1_CH2_CH3_DriverIRQHandler();
}

WEAK void EWM_IRQHandler(void)
{   EWM_DriverIRQHandler();
}

WEAK void SEMC_IRQHandler(void)
{   SEMC_DriverIRQHandler();
}

WEAK void LPIT3_IRQHandler(void)
{   LPIT3_DriverIRQHandler();
}

WEAK void LPTMR3_IRQHandler(void)
{   LPTMR3_DriverIRQHandler();
}

WEAK void TMR4_IRQHandler(void)
{   TMR4_DriverIRQHandler();
}

WEAK void LPI2C5_IRQHandler(void)
{   LPI2C5_DriverIRQHandler();
}

WEAK void LPI2C6_IRQHandler(void)
{   LPI2C6_DriverIRQHandler();
}

WEAK void SAI4_IRQHandler(void)
{   SAI4_DriverIRQHandler();
}

WEAK void SPDIF_IRQHandler(void)
{   SPDIF_DriverIRQHandler();
}

WEAK void LPUART9_IRQHandler(void)
{   LPUART9_DriverIRQHandler();
}

WEAK void LPUART10_IRQHandler(void)
{   LPUART10_DriverIRQHandler();
}

WEAK void LPUART11_IRQHandler(void)
{   LPUART11_DriverIRQHandler();
}

WEAK void LPUART12_IRQHandler(void)
{   LPUART12_DriverIRQHandler();
}

WEAK void INTG_BOOTROM_DEBUG_CTRL_IRQHandler(void)
{   INTG_BOOTROM_DEBUG_CTRL_DriverIRQHandler();
}

WEAK void EDGELOCK_REQ1_IRQHandler(void)
{   EDGELOCK_REQ1_DriverIRQHandler();
}

WEAK void EDGELOCK_REQ2_IRQHandler(void)
{   EDGELOCK_REQ2_DriverIRQHandler();
}

WEAK void EDGELOCK_REQ3_IRQHandler(void)
{   EDGELOCK_REQ3_DriverIRQHandler();
}

WEAK void TMR3_IRQHandler(void)
{   TMR3_DriverIRQHandler();
}

WEAK void JTAGC_IRQHandler(void)
{   JTAGC_DriverIRQHandler();
}

WEAK void M33_SYSRESET_REQ_IRQHandler(void)
{   M33_SYSRESET_REQ_DriverIRQHandler();
}

WEAK void M33_LOCKUP_IRQHandler(void)
{   M33_LOCKUP_DriverIRQHandler();
}

WEAK void M7_SYSRESET_REQ_IRQHandler(void)
{   M7_SYSRESET_REQ_DriverIRQHandler();
}

WEAK void M7_LOCKUP_IRQHandler(void)
{   M7_LOCKUP_DriverIRQHandler();
}

WEAK void PWM2_FAULT_IRQHandler(void)
{   PWM2_FAULT_DriverIRQHandler();
}

WEAK void PWM2_0_IRQHandler(void)
{   PWM2_0_DriverIRQHandler();
}

WEAK void PWM2_1_IRQHandler(void)
{   PWM2_1_DriverIRQHandler();
}

WEAK void PWM2_2_IRQHandler(void)
{   PWM2_2_DriverIRQHandler();
}

WEAK void PWM2_3_IRQHandler(void)
{   PWM2_3_DriverIRQHandler();
}

WEAK void PWM3_FAULT_IRQHandler(void)
{   PWM3_FAULT_DriverIRQHandler();
}

WEAK void PWM3_0_IRQHandler(void)
{   PWM3_0_DriverIRQHandler();
}

WEAK void PWM3_1_IRQHandler(void)
{   PWM3_1_DriverIRQHandler();
}

WEAK void PWM3_2_IRQHandler(void)
{   PWM3_2_DriverIRQHandler();
}

WEAK void PWM3_3_IRQHandler(void)
{   PWM3_3_DriverIRQHandler();
}

WEAK void PWM4_FAULT_IRQHandler(void)
{   PWM4_FAULT_DriverIRQHandler();
}

WEAK void PWM4_0_IRQHandler(void)
{   PWM4_0_DriverIRQHandler();
}

WEAK void PWM4_1_IRQHandler(void)
{   PWM4_1_DriverIRQHandler();
}

WEAK void PWM4_2_IRQHandler(void)
{   PWM4_2_DriverIRQHandler();
}

WEAK void PWM4_3_IRQHandler(void)
{   PWM4_3_DriverIRQHandler();
}

WEAK void EQDC1_IRQHandler(void)
{   EQDC1_DriverIRQHandler();
}

WEAK void EQDC2_IRQHandler(void)
{   EQDC2_DriverIRQHandler();
}

WEAK void EQDC3_IRQHandler(void)
{   EQDC3_DriverIRQHandler();
}

WEAK void EQDC4_IRQHandler(void)
{   EQDC4_DriverIRQHandler();
}

WEAK void ADC2_IRQHandler(void)
{   ADC2_DriverIRQHandler();
}

WEAK void DCDC_IRQHandler(void)
{   DCDC_DriverIRQHandler();
}

WEAK void CAN3_IRQHandler(void)
{   CAN3_DriverIRQHandler();
}

WEAK void CAN3_ERROR_IRQHandler(void)
{   CAN3_ERROR_DriverIRQHandler();
}

WEAK void DAC_IRQHandler(void)
{   DAC_DriverIRQHandler();
}

WEAK void LPSPI5_IRQHandler(void)
{   LPSPI5_DriverIRQHandler();
}

WEAK void LPSPI6_IRQHandler(void)
{   LPSPI6_DriverIRQHandler();
}

WEAK void LPUART7_IRQHandler(void)
{   LPUART7_DriverIRQHandler();
}

WEAK void LPUART8_IRQHandler(void)
{   LPUART8_DriverIRQHandler();
}

